avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx_dmaca.c
        p_tctrl_dma = &hdl->queue[hdl->qindex_app_tx];

        tx_cfg_dmaca.act_source           = hdl->rom->dmaca_tx_act_src;
        tx_cfg_dmaca.transfer_mode        = DMACA_TRANSFER_MODE_NORMAL;
        tx_cfg_dmaca.data_size            = DMACA_DATA_SIZE_BYTE;
        tx_cfg_dmaca.dtie_request         = DMACA_TRANSFER_END_INTERRUPT_ENABLE;
        tx_cfg_dmaca.interrupt_sel        = DMACA_CLEAR_INTERRUPT_FLAG_BEGINNING_TRANSFER;
        tx_cfg_dmaca.des_addr_mode        = DMACA_DES_ADDR_FIXED;
        tx_cfg_dmaca.p_des_addr           = (void *)&hdl->rom->regs->TDR;

        tx_cfg_dmaca.request_source       = DMACA_TRANSFER_REQUEST_PERIPHERAL;
        tx_cfg_dmaca.esie_request         = DMACA_TRANSFER_ESCAPE_END_INTERRUPT_DISABLE;
        tx_cfg_dmaca.rptie_request        = DMACA_REPEAT_SIZE_END_INTERRUPT_DISABLE;
        tx_cfg_dmaca.sarie_request        = DMACA_SRC_ADDR_EXT_REP_AREA_OVER_INTERRUPT_DISABLE;
        tx_cfg_dmaca.darie_request        = DMACA_DES_ADDR_EXT_REP_AREA_OVER_INTERRUPT_DISABLE;
        tx_cfg_dmaca.src_addr_repeat_area = DMACA_SRC_ADDR_EXT_REP_AREA_NONE;
        tx_cfg_dmaca.des_addr_repeat_area = DMACA_DES_ADDR_EXT_REP_AREA_NONE;
        tx_cfg_dmaca.offset_value         = 0;

        if (NULL == p_src)
        {
            tx_cfg_dmaca.src_addr_mode     = DMACA_SRC_ADDR_FIXED;
            tx_cfg_dmaca.p_src_addr        = (void *)&tx_dummy_buf;
        }
        else
        {
            tx_cfg_dmaca.repeat_block_side = DMACA_REPEAT_BLOCK_DISABLE;
            tx_cfg_dmaca.src_addr_mode     = DMACA_SRC_ADDR_INCR;
            tx_cfg_dmaca.p_src_addr        = (void *)p_src;
        }

        tx_cfg_dmaca.transfer_count = (uint32_t)(length);

        err_dmaca = R_DMACA_Open(hdl->rom->dmaca_tx_channel);
        if (DMACA_SUCCESS == err_dmaca)
        {
            err_dmaca = R_DMACA_Control(hdl->rom->dmaca_tx_channel, DMACA_CMD_DISABLE, &stat_dmaca);
        }

        if (DMACA_SUCCESS == err_dmaca)
        {
            if (length > 0)
            {
                if (NULL == p_src)
                {
                    p_tctrl_dma->p_tx_fraction_buf = NULL;
                }
                else
                {
                    p_tctrl_dma->p_tx_fraction_buf = (uint8_t*)((uint32_t)tx_cfg_dmaca.p_src_addr);
                }

                p_tctrl_dma->tx_fraction = 0;
                if (SCI_CH0 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci0_dmac_tx_callback);
                }
                else if (SCI_CH1 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci1_dmac_tx_callback);
                }
                else if (SCI_CH2 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci2_dmac_tx_callback);
                }
                else if (SCI_CH3 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci3_dmac_tx_callback);
                }
                else if (SCI_CH4 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci4_dmac_tx_callback);
                }
                else if (SCI_CH5 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci5_dmac_tx_callback);
                }
                else if (SCI_CH6 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci6_dmac_tx_callback);
                }
                else if (SCI_CH7 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci7_dmac_tx_callback);
                }
                else if (SCI_CH8 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci8_dmac_tx_callback);
                }
                else if (SCI_CH9 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci9_dmac_tx_callback);
                }
                else if (SCI_CH10 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci10_dmac_tx_callback);
                }
                else if (SCI_CH11 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci11_dmac_tx_callback);
                }
                else if (SCI_CH12 == hdl->rom->chan)
                {
                    err_dmaca = R_DMACA_Int_Callback(hdl->rom->dmaca_tx_channel,(void *)sci12_dmac_tx_callback);
                }
                else
                {
                    err_dmaca = DMACA_ERR_INTERNAL;
                }

                if (DMACA_SUCCESS == err_dmaca)
                {
                    err_dmaca = R_DMACA_Create(hdl->rom->dmaca_tx_channel, &tx_cfg_dmaca);
                }

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX66T) || defined(BSP_MCU_RX72T) || defined(BSP_MCU_RX72M) || defined(BSP_MCU_RX72N) || defined(BSP_MCU_RX66N)|| defined(BSP_MCU_RX671)
                    err_dmaca = R_DMACA_Int_Enable(hdl->rom->dmaca_tx_channel, *hdl->rom->ipr_txi);
#else
                    err_dmaca = R_DMACA_Int_Enable(hdl->rom->dmaca_tx_channel, *hdl->rom->ipr);
#endif
                if (DMACA_SUCCESS == err_dmaca)
                {
                    err_dmaca = R_DMACA_Control(hdl->rom->dmaca_tx_channel, DMACA_CMD_ENABLE, &stat_dmaca);
                }
            }
            else
            {
                
            }
        }

        if (DMACA_SUCCESS != err_dmaca)
        {
            err_sci = SCI_ERR_DMACA;
        }

        return err_sci;
}
/**********************************************************************************************************************
 End of function sci_tx_dmaca_create
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci_rx_dmaca_create
* Description  : This function create DMAC to receive data from SCI RDR and save to p_dst (by DMAC without CPU)
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                p_dst -
*                    The address of destination need to be saved
*                lenght -
*                    The number of data need to be received
* Return Value : SCI_SUCCESS -
*                    Create DMAC successfully
*                SCI_ERR_DMACA -
*                    Create DMAC NOT successfully
 *********************************************************************************************************************/
sci_err_t sci_rx_dmaca_create(sci_hdl_t const hdl, uint8_t *p_dst, uint16_t const length)
{
        sci_fifo_ctrl_t          *p_rctrl_dma;
        sci_err_t     err_sci = SCI_SUCCESS;
        dmaca_return_t err_dmaca = DMACA_SUCCESS;
        dmaca_stat_t   stat_dmaca;
        dmaca_transfer_data_cfg_t rx_cfg_dmaca;

