avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx_dmaca.c
            /* Do callback if available */
            if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
            {
                args.hdl = hdl;
#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
                if (SCI_MODE_SYNC == hdl->mode || SCI_MODE_SSPI == hdl->mode)
                {
                    args.event = SCI_EVT_RX_SYNC_DONE;
                }
                else
#endif
                {
                    args.event = SCI_EVT_RX_DONE;
                }

                /* Casting to void type is valid */
                hdl->callback((void *)&args);
            }
        }
#endif
    }
    else
    {
#if SCI_CFG_FIFO_INCLUDED
        if (true == hdl->fifo_ctrl)
        {
            SCI_PRV_RX_FIFO_THRESHOLD = p_ctrl->rx_fraction;
        }
#endif
    }
}
/**********************************************************************************************************************
 End of function sci_dmac_rx_handler
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci0_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI0 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci0_dmac_tx_callback(void)
{
#if SCI_CFG_CH0_INCLUDED
    sci_dmac_tx_handler(&ch0_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci0_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci1_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI1 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci1_dmac_tx_callback(void)
{
#if SCI_CFG_CH1_INCLUDED
    sci_dmac_tx_handler(&ch1_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci1_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci2_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI2 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci2_dmac_tx_callback(void)
{
#if SCI_CFG_CH2_INCLUDED
    sci_dmac_tx_handler(&ch2_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci2_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci3_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI3 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci3_dmac_tx_callback(void)
{
#if SCI_CFG_CH3_INCLUDED
    sci_dmac_tx_handler(&ch3_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci3_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci4_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI4 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci4_dmac_tx_callback(void)
{
#if SCI_CFG_CH4_INCLUDED
    sci_dmac_tx_handler(&ch4_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci5_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI5 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci5_dmac_tx_callback(void)
{
#if SCI_CFG_CH5_INCLUDED
    sci_dmac_tx_handler(&ch5_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci6_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI6 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci6_dmac_tx_callback(void)
{
#if SCI_CFG_CH6_INCLUDED
    sci_dmac_tx_handler(&ch6_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci7_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI7 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci7_dmac_tx_callback(void)
{
#if SCI_CFG_CH7_INCLUDED
    sci_dmac_tx_handler(&ch7_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci8_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI8 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci8_dmac_tx_callback(void)
{
#if SCI_CFG_CH8_INCLUDED
    sci_dmac_tx_handler(&ch8_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci8_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci9_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI9 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci9_dmac_tx_callback(void)
{
#if SCI_CFG_CH9_INCLUDED
    sci_dmac_tx_handler(&ch9_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci9_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci10_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI10 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci10_dmac_tx_callback(void)
{
#if SCI_CFG_CH10_INCLUDED
    sci_dmac_tx_handler(&ch10_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci10_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci11_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI11 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci11_dmac_tx_callback(void)
{
#if SCI_CFG_CH11_INCLUDED
    sci_dmac_tx_handler(&ch11_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci11_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci12_dmac_tx_callback
* Description  : DMAC interrupt routines for SCI12 channel
* Return Value : None
 *********************************************************************************************************************/
static void sci12_dmac_tx_callback(void)
{
#if SCI_CFG_CH12_INCLUDED
    sci_dmac_tx_handler(&ch12_ctrl);
#endif
}
/**********************************************************************************************************************
 End of function sci12_dmac_tx_callback
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: sci_dmac_tx_handler
* Description  : This function is called to close and disable interrupt for DMAC channel,
                 when SCI transmit data completely by DMAC.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
* Return Value : None
 *********************************************************************************************************************/
static void sci_dmac_tx_handler(sci_hdl_t const hdl)
{
#if (RX_DTC_DMACA_ENABLE & 0x02)
    if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable)
    {
        if(4 == hdl->rom->dmaca_tx_channel || 5 == hdl->rom->dmaca_tx_channel || 6 == hdl->rom->dmaca_tx_channel || 7 == hdl->rom->dmaca_tx_channel)
        {
            dmaca_stat_t   stat_dmaca;
            R_DMACA_Control(hdl->rom->dmaca_tx_channel, DMACA_CMD_DTIF_STATUS_CLR, &stat_dmaca);
        }
    }
#endif
}
/**********************************************************************************************************************
 End of function sci_dmac_tx_handler
*/
#endif /* ((TX_DTC_DMACA_ENABLE & 0x02) || (RX_DTC_DMACA_ENABLE & 0x02)) */
